**复习：**在前面我们已经学习了Pandas基础，第二章我们开始进入数据分析的业务部分，在第二章第一节的内容中，我们学习了**数据的清洗**，这一部分十分重要，只有数据变得相对干净，我们之后对数据的分析才可以更有力。而这一节，我们要做的是数据重构，数据重构依旧属于数据理解（准备）的范围。

#### 开始之前，导入numpy、pandas包和数据

In [30]:
import pandas as pd
import numpy as np

In [31]:
# 载入data文件中的:train-left-up.csv
df_left_up=pd.read_csv('D:/数据分析项目/第二章项目集合/data/train-left-up.csv',engine='python')
df_left_up.head()

,PassengerId,Survived,Pclass,Name
0,1,0,3,"Braund, Mr. Owen Harris"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,3,1,3,"Heikkinen, Miss. Laina"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
4,5,0,3,"Allen, Mr. William Henry"

# 2 第二章：数据重构

### 2.4 数据的合并

#### 2.4.1 任务一：将data文件夹里面的所有数据都载入，观察数据的之间的关系

In [32]:
df_left_down=pd.read_csv('D:/数据分析项目/第二章项目集合/data/train-left-down.csv',engine='python')
df_right_down=pd.read_csv('D:/数据分析项目/第二章项目集合/data/train-right-down.csv',engine='python')
df_right_up=pd.read_csv('D:/数据分析项目/第二章项目集合/data/train-right-up.csv',engine='python')

In [39]:
df_right_up.head(3)

      Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0    male  22.0      1      0         A/5 21171   7.2500   NaN        S
1  female  38.0      1      0          PC 17599  71.2833   C85        C
2  female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S

这四份数据是之前的train.csv数据的四个部分，整合之后就是完整的train数据

【提示】结合之前我们加载的train.csv数据，大致预测一下上面的数据是什么

#### 2.4.2：任务二：使用concat方法：将数据train-left-up.csv和train-right-up.csv横向合并为一张表，并保存这张表为result_up

In [6]:
result_up=pd.concat([df_left_up,df_right_up],axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### 2.4.3 任务三：使用concat方法：将train-left-down和train-right-down横向合并为一张表，并保存这张表为result_down。然后将上边的result_up和result_down纵向合并为result。

In [22]:
result_down=pd.concat([df_left_down,df_right_down],axis=1)
result=pd.concat([result_up,result_down]).reset_index(inplace=False)
result.head(3)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### 2.4.4 任务四：使用DataFrame自带的方法join方法和append：完成任务二和任务三的任务

In [36]:
result_up=df_left_up.join(df_right_up)
result_down=df_left_down.join(df_right_down)
result=result_up.append(result_down)
result.reset_index(inplace=True)
del result['index']

In [38]:
result.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### 2.4.5 任务五：使用Panads的merge方法和DataFrame的append方法：完成任务二和任务三的任务

In [46]:
result_up=pd.merge(df_left_up,df_right_up,left_index=True,right_index=True)
result_down=pd.merge(df_left_down,df_right_down,left_index=True,right_index=True)
result=result_up.append(result_down)
result.reset_index(inplace=True)
del result['index']
result.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

【思考】对比merge、join以及concat的方法的不同以及相同。思考一下在任务四和任务五的情况下，为什么都要求使用DataFrame的append方法，如何只要求使用merge或者join可不可以完成任务四和任务五呢？

回答：concat可以横向纵向合并，但merge和join侧重横向合并，所以需要append辅助纵向合并

#### 2.4.6 任务六：完成的数据保存为result.csv

In [47]:
result.to_csv('D:/数据分析项目/第二章项目集合/data/result.csv')

### 2.5 换一种角度看数据

#### 2.5.1 任务一：将我们的数据变为Series类型的数据

In [56]:
df=pd.read_csv('D:/数据分析项目/第二章项目集合/data/result.csv',engine='python')
df.head()
df_s=df.stack() #列转行，多层级转的时候可以设置参数确定转哪一层 unstack()反向操作
df_s.head()

0  Unnamed: 0                           0
   PassengerId                          1
   Survived                             0
   Pclass                               3
   Name           Braund, Mr. Owen Harris
dtype: object

In [57]:
df_s.to_csv('D:/数据分析项目/第二章项目集合/data/result_series.csv')

In [59]:
df_ss=pd.read_csv('D:/数据分析项目/第二章项目集合/data/result_series.csv',engine='python')
df_ss.head()

   0   Unnamed: 0                      0.1
0  0  PassengerId                        1
1  0     Survived                        0
2  0       Pclass                        3
3  0         Name  Braund, Mr. Owen Harris
4  0          Sex                     male

# 2 第二章：数据重构

## 第一部分：数据聚合与运算

### 2.6 数据运用

#### 2.6.1 任务一：通过教材《Python for Data Analysis》P303、Google or anything来学习了解GroupBy机制

心得：groupby是用于数据分类划分使用的，分类之后可以使用各种函数，例如：min,max,sum,mean,median,std,var,count等进行聚合操作

2.4.2：任务二：计算泰坦尼克号男性与女性的平均票价

In [73]:
df=pd.read_csv('D:/数据分析项目/第二章项目集合/data/result.csv',engine='python')
df1=df['Fare'].groupby(df['Sex']).mean()
df1

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

2.4.3：任务三：统计泰坦尼克号中男女的存活人数

In [62]:
df2=df['Survived'].groupby(df['Sex']).sum()
df2

Sex
female    233
male      109
Name: Survived, dtype: int64

2.4.4：任务四：计算客舱不同等级的存活人数

In [63]:
df3=df['Survived'].groupby(df['Pclass']).sum()
df3

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

【思考】从任务二到任务四中，这些运算可以通过agg()函数来同时计算。并且可以使用rename函数修改列名。你可以按照提示写出这个过程吗？

In [92]:
df4=df.groupby(['Sex']).agg({'Fare':'mean','Survived':'sum'}).rename(columns={'Fare': 'sum_Fare', 'Survived': 'sum_Survived'})
df4.head()

         sum_Fare  sum_Survived
Sex
female  44.479818           233
male    25.523893           109

#### 2.4.5：任务五：统计在不同等级的票中的不同年龄的船票花费的平均值

In [71]:
df.groupby(['Pclass','Age'])['Fare'].mean().head()

Pclass  Age
1       0.92     151.5500
        2.00     151.5500
        4.00      81.8583
        11.00    120.0000
        14.00    120.0000
Name: Fare, dtype: float64

#### 2.4.6：任务六：将任务二和任务三的数据合并，并保存到sex_fare_survived.csv

In [80]:
df6=pd.DataFrame({'Fare':df1,'Survived':df2})
df6.to_csv('D:/数据分析项目/第二章项目集合/data/sex_fare_survived.csv')

#### 2.4.7：任务七：得出不同年龄的总的存活人数，然后找出存活人数的最高的年龄，最后计算存活人数最高的存活率（存活人数/总人数）

In [84]:
df7=df['Survived'].groupby(df['Age']).sum()
df7[df7.values==df7.max()]

Age
24.0    15
Name: Survived, dtype: int64

In [85]:
df['Survived'].sum()

342

In [88]:
survived_percent=df7[df7.values==df7.max()]/df['Survived'].sum()
survived_percent

Age
24.0    0.04386
Name: Survived, dtype: float64